# <center> Removing Outliers
### Import Preliminaries

In [18]:
import pandas as pd

og_df = pd.DataFrame(columns = ['name','age','score'],
                  data = [['Matt',24,99.0],
                         ['Chris', 26,10.0],
                         ['Ashley',22, 98.0],
                         ['Link', 16,100.0],
                         ['Avi', 96,100.0],
                         ['Steph', 1,98.0]],)

og_df

     name  age  score
0    Matt   24   99.0
1   Chris   26   10.0
2  Ashley   22   98.0
3    Link   16  100.0
4     Avi   96  100.0
5   Steph    1   98.0

### Remove Outliers by Quantile

In [19]:
df = og_df.copy()

# Remove numerical outliers by quantile
for col in df:
    if df[col].dtype == 'int64' or df[col].dtype == 'float64':
        
      # Set quantile limits and replacement mean
      upper_limit = df[col].quantile(.90)
      lower_limit = df[col].quantile(.10)
      mean = df[col].mean()
    
      # replace outliers
      for index,value in enumerate(df[col]):
        if value > upper_limit: df.loc[index,col] = mean
        if value < lower_limit: df.loc[index,col] = mean

# View the dataframe
df

     name        age       score
0    Matt  24.000000   99.000000
1   Chris  26.000000   84.166667
2  Ashley  22.000000   98.000000
3    Link  16.000000  100.000000
4     Avi  30.833333  100.000000
5   Steph  30.833333   98.000000

### Removing Oultiers by Value

In [28]:
# Original DataFrame
df = og_df.copy()
df

     name  age  score
0    Matt   24   99.0
1   Chris   26   10.0
2  Ashley   22   98.0
3    Link   16  100.0
4     Avi   96  100.0
5   Steph    1   98.0

In [33]:
# Replacing Outliers Using Pandas's replace function
outliers = [96,1]
df.age.replace(outliers, df.age.mean(), inplace=True)

# View DataFrame
df

     name        age  score
0    Matt  24.000000   99.0
1   Chris  26.000000   10.0
2  Ashley  22.000000   98.0
3    Link  16.000000  100.0
4     Avi  30.833333  100.0
5   Steph  30.833333   98.0

Author: Kavi